cask_args appdir: '/Applications'

##
# Preflight
##

# Tap homebrew
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'helm/tap'
tap 'hashicorp/tap'
tap 'vectordotdev/brew'

##
# Browsers
#
# We prefer Firefox because it's open source.
##

# Firefox web browser
cask 'firefox'

# Firefox developer edition, which features programming tools.
cask 'firefox-developer-edition'

# Brave web browser, which features security by default.
cask 'brave-browser'

##
#
# Kubernetes
#
##
# Cluster management tool for AWS.
brew 'kops'

# Kubernetes command-line tool to run commands against Kubernetes clusters.
brew 'kubectl'

# Helmfile is a declarative spec for deploying helm charts.
brew 'helmfile'

# Lens is an IDE and Dashboard for Kubernetes
cask 'lens'

# MacOS implementation of Latex for building PDF documents
cask 'mactex'


#############################################################
# Software Development                                      #
#############################################################

# Development Apps
# @todo iterm, etc

# Development Langs, Compilers, Package Managers and SDKs
brew 'gcc'
brew 'go'
brew 'lua'
brew 'luarocks'


# utility to run Github actions locally for testing.
brew 'act'

cask 'alacritty'

# Stylua is a code formatter for Lua. Mainly used for helping me format my Neovim configuration.
brew 'stylua'

# Docker Desktop alternative
brew 'colima'

# Mainly used for Bitcoin compilation - helps automate compilation process.
brew 'automake'

# Bitcoin dep. Used to help compile shared libraries.
brew 'libtool'

# Bitcoin dep. Brings portable shared C++ libs.
brew 'boost'

# Bitcoin dep. Helps compiliation.
brew 'pkg-config'

# Bitcoin dep. Async notifications.
brew 'libevent'

# Bitcoin dep. Used for legacy wallets
brew 'berkeley-db@4'

# Logfile Highlighter
brew 'tailspin'

##
# Utilities
#
# We prefer Firefox because it's open source.
##

brew 'ack'

# Utility that cleans up leftover files when deleting an application.
cask 'appcleaner'

# Atuin replaces your existing shell history with a SQLite database, and records additional context for your commands.
brew 'atuin'

# bat is like `cat` plus line numbers, syntax highlighting, and more.
brew 'bat'

# https://github.com/Nukesor/pueue#why-should-i-use-it (This is not implemented yet, but marking as a @todo).
brew 'pueue'

# Intuitive find & replace CLI (sed alternative)
brew 'sd'

# An alternative to OSX's native spotlight search. Comes with lots of nice features out of the gate to enhance productivity.
cask 'raycast'

brew 'brotli'
brew 'broot'
brew 'coreutils'
brew 'cmake'
brew 'diff-so-fancy'
brew 'exa'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'geckodriver'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnupg2'
brew 'gnuplot'
brew 'htop'
brew 'hugo'
brew 'irssi'
brew 'libyaml'
brew 'lynis'
brew 'mas'
brew 'moreutils'
brew 'ncdu'
brew 'neovim'
brew 'nmap'
brew 'openssh'
brew 'openssl'
brew 'pandoc'
brew 'pinentry-mac'
brew 'pyenv'
brew 'rbenv'
brew 'ripgrep'
brew 'screen'
brew 'sccache'
brew 'shellcheck'
brew 'sqlite'
brew 'starship'
brew 'ssh-copy-id'
brew 'task'
brew 'tmux'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew "upx"
brew "tor"
brew "yarn"
brew "zola"
brew "zstd"
brew "zlib"
brew "getantibody/tap/antibody"
brew "pnpm"
brew "fnm"
brew 'vale'
# Helm v3 helpers
brew 'chart-releaser'
brew 'chart-testing'
# Needed for chart-testing
brew 'yamllint'
# Needed for chart-testing
brew 'yamale'
brew 'pipx'
brew 'hashicorp/tap/terraform'
brew 'fluxcd/tap/flux'
brew 'kustomize'
brew 'terrascan'
brew 'jq'
brew 'pre-commit'
brew 'checkov'
brew 'tfsec'
brew 'tflint'
brew 'kubeaudit'
brew 'age'
brew 'sops'
brew 'velero'
brew 'just'
brew 'terraformer'
brew 'k9s'
brew 'direnv'
brew 'kubectx'
brew 'kube-linter'
brew 'hadolint'
brew 'vector'


#Casks
cask 'alfred'
cask 'docker'
cask 'flux'
cask 'firefox'
cask 'iterm2'
cask 'insomnia'
cask 'kap'
cask 'karabiner-elements'
cask 'lulu'
cask 'rectangle'
cask 'spotify'
cask 'wireshark'
cask 'telegram'
cask 'raycast'
cask 'obsidian'
cask 'stats'
cask 'fig'
cask 'github'
cask '1password-cli'
cask 'eloston-chromium'
cask 'chromedriver'

# @todo not sure how to do this yet but we need to include this one.
# brew install --cask 1password/tap/1password-cli
#
#Mac Applications
#mas "Amphetamine" id: 937984704
# mas "Bear", id: 1091189122
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "LastPass", id: 926036361
# mas "Magnet", id: 441258766
# mas "Monit", id: 1014850245
# mas "Numbers", id: 409203825
# mas "Owly", id: 882812218
# mas "Pages", id: 409201541
# mas "Telegram", id: 747648890
# mas "WireGuard", id: 1451685025
# mas "Xcode", id: 497799835
