# frozen_string_literal: true

cask_args appdir: "/Applications"

#############################################################
# Preflight                                                 #
#############################################################

# Tap homebrew
tap "homebrew/bundle"
tap "homebrew/services"
tap "helm/tap"

#############################################################
# Software Development                                      #
#############################################################

# Development Apps
# @todo iterm, etc

# Development Langs, Compilers, Package Managers and SDKs
brew "gcc"
brew "go"
brew "lua"
brew "luarocks"
brew "mise"

# Python Version Manager
brew "rye"
# Node Version Manager
brew "fnm"

# utility to run Github actions locally for testing.
brew "act"

# @todo review if this can be managed by Mason in nvim rather than here.
# Stylua is a code formatter for Lua. Mainly used for helping me format my Neovim configuration.
brew "stylua"

# Container runtime (Replaces Docker Desktop)
brew "colima"

# Docker Runtime (Used with Colima above)
brew "docker"
brew "docker-compose"

# Mainly used for Bitcoin compilation - helps automate compilation process.
brew "automake"

# Bitcoin dep. Used to help compile shared libraries.
brew "libtool"

# Bitcoin dep. Brings portable shared C++ libs.
brew "boost"

# Bitcoin dep. Helps compiliation.
brew "pkg-config"

# Bitcoin dep. Async notifications.
brew "libevent"

# Bitcoin dep. Used for legacy wallets
brew "berkeley-db@4"

# Logfile Highlighter
brew "tailspin"

##
#
# Kubernetes
#
##
# Cluster management tool for AWS.
brew "kops"

# Kubernetes command-line tool to run commands against Kubernetes clusters.
brew "kubectl"

# Faster context switching with Kubernetes
brew "kubectx"

# Helmfile is a declarative spec for deploying helm charts.
brew "helmfile"

# Lens is an IDE and Dashboard for Kubernetes
cask "lens"

##
# Utilities
#
# We prefer Firefox because it's open source.
##

brew "ack"

# Utility that cleans up leftover files when deleting an application.
cask "appcleaner"

# Atuin replaces your existing shell history with a SQLite database, and records additional context for your commands.
brew "atuin"

# bat is like `cat` plus line numbers, syntax highlighting, and more.
brew "bat"

# https://github.com/Nukesor/pueue#why-should-i-use-it (This is not implemented yet, but marking as a @todo).
brew "pueue"

# Intuitive find & replace CLI (sed alternative)
brew "sd"

# Replacement for Exa -- aka replacement for ls
brew "eza"

# Protocol Buffers - used for protobuf development e.g. GRPC
brew "protobuf"

# Lossless compression algorithm
brew "brotli"

# Linux versions of Core Utilities (gls, gcp, etc)
brew "coreutils"

# C / C++ Bundler?
brew "cmake"

# Better Git Diffs
brew "diff-so-fancy"

# Alternative to find
brew "fd"

# Linux Find utilities xargs, etc
brew "findutils"

# Fuzzy Finder
brew "fzf"

# Like Chromedriver but for Firefox
brew "geckodriver"

# Git...
brew "git"

# Versioning Larger files with Git
brew "git-lfs"

# Linux SED?
brew "gnu-sed"

# GPG
brew "gnupg"

# Terminal Plotting utility
brew "gnuplot"

# Better "top" utility
brew "htop"

# Terminal chat client
brew "irssi"

# YAML parser
brew "libyaml"

# Security utility
brew "lynis"

# Mac Apple Store CLI
brew "mas"

# More linux utilites
brew "moreutils"

# Disk space analyzer
brew "ncdu"

# Terminal based editor
brew "neovim"

# Port scanning utility
brew "nmap"

# Homebrew managed OpenSSH
brew "openssh"
# Homebrew managed Open SSL
brew "openssl"

# Format Converter
brew "pandoc"

# GUI for PGP
brew "pinentry-mac"

# Ruby version manager
brew "rbenv"

# Improved version of grep
brew "ripgrep"

# Terminal Multiplexer @todo maybe remove (tmux probs better alternative)
brew "screen"

# Cache for Rust
brew "sccache"

# Shell formatter
brew "shellcheck"

# Sqlite DB
brew "sqlite"

# Terminal Prompt
brew "starship"

# Add ssh key to authorized keys @todo maybe remove
brew "ssh-copy-id"

# Terminal Multiplexer
brew "tmux"

# Http tool
brew "wget"

# ZSH Shell
brew "zsh"

# ZSH Completions
brew "zsh-completions"

# Compression for executables (Probably delete can just use in docker or CI)
brew "upx"
# Tor network
brew "tor"

# Yarn utility for NPM
brew "yarn"

# Real time compression algorithm
brew "zstd"

# Lossless Compression Algorithm
brew "zlib"

# NPM new utility
brew "pnpm"


# More or less fancy spell check
brew "vale"

# Terraform infrastructure management
brew "hashicorp/tap/terraform"

# Templater for Kubernetes deployments
brew "kustomize"

# Auditor for Terraform files
brew "terrascan"

# JSON Parser
brew "jq"

# Terrafor Security Scanner
brew "tfsec"

# Terraform Linter
brew "tflint"

# Kubernetes auditor
brew "kubeaudit"

# Encryption tool
brew "age"

# Encryption tool
brew "sops"

# Kubernetes backup tool
brew "velero"

# Taskrunner written in rust
brew "just"

# Generate Terraform files from existing infrastructure
brew "terraformer"

# Kubernetes Manager Via CLI
brew "k9s"

# Load environment varibles based on directory
brew "direnv"

# Kubernetes linter
brew "kube-linter"

# Dockerfile linter
brew "hadolint"

# ZSH Plugin manager
brew "antidote"

# Helm Utility for publishing charts
brew "helm/tap/chart-releaser"

# Yaml linter -> @todo see if we can install via Mason
brew "yamllint"

# Pre-commit hook
brew "pre-commit"

# Lua compiler
brew "luajit", args: ["HEAD"]

# Library for Yubi keys
brew "libfido2"

# DNS library written in C @todo review if needed
brew "ldns"

# i18n library @todo review
brew "pango"

# Open type text shaping engine @Todo do we need?
brew "harfbuzz"

# Graphics library
brew "gd"

# Decoding .avi files
brew "libavif"

# DNS Resolver
brew "unbound"

# IoC tool for auditing setups
brew "checkov"

# Testing of helm charts
brew "chart-testing"

# YAML Validator
brew "yamale"
# Core app for C
brew "glib"

# GNU i18n library
brew "gettext"

# AV1 decoder
brew "aom"

# JPEG compression
brew "jpeg-xl"

# Image compression
brew "webp"

#############################################################
# Non-Mac Store Applications
#############################################################

# Password Manager - Not available via Mac Store
cask "1password"

# CLI for 1Password
cask "1password-cli"

# Tints screen orange to protect my eyeballs at night
cask "flux"

# Terminal used to replace Mac's base Terminal
cask "iterm2"

# API Manager and Tester
cask "insomnia"

# Screen recorder for mac
cask "kap"

# Custom Keymapper - used currently to map caps lock to a hyper key.
cask "karabiner-elements"

# Firewall Extension for mac
cask "lulu"

# Window Manager via keybindings
cask "rectangle"

# Spotifty
cask "spotify"

# An alternative to OSX's native spotlight search. Comes with lots of nice features out of the gate to enhance productivity.
cask "raycast"

# Note management application
cask "obsidian"

# Shows mac stats in the menubar
cask "stats"

# Github Desktop
cask "github"

# Firefox web browser
cask "firefox"

# Firefox developer edition, which features programming tools.
cask "firefox@developer-edition"

# Brave web browser, which features security by default.
cask "brave-browser"

# Ungoogled Chromium
cask "eloston-chromium"

#############################################################
# Fonts
#############################################################

# Font used for coding ligatures
cask "font-fira-code"

#############################################################
# Applications
#############################################################

# 1Password Safari Extensions
mas "1Password for Safari", id: 1_569_813_296

# Photo editing software
mas "Affinity Photo", id: 824_183_456

# Prevents Mac from Sleeping
mas "Amphetamine", id: 937_984_704

# Music
mas "GarageBand", id: 682_658_836

# Movies
mas "iMovie", id: 408_981_434

# Slideshows
mas "Keynote", id: 409_183_694

# Money Management
mas "MoneyWiz", id: 1_511_185_140

# Excel
mas "Numbers", id: 409_203_825

# Docs
mas "Pages", id: 409_201_541

# Messaging Application
mas "Telegram", id: 747_648_890

# Mac Development
mas "Xcode", id: 497_799_835
