cask_args appdir: '/Applications'

##
# Preflight
##

# Tap homebrew
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'

##
# Browsers
#
# We prefer Firefox because it's open source.
##

# Firefox web browser
cask 'firefox'

# Firefox developer edition, which features programming tools.
cask 'firefox-developer-edition'

# Brave web browser, which features security by default.
cask 'brave-browser'

# De-Googled Chrome
cask 'eloston-chromium'

# Opera web browser
cask 'opera'

##
#
# Kubernetes
#
##
# Cluster management tool for AWS.
brew 'kops'

# Kubernetes command-line tool to run commands against Kubernetes clusters.
brew 'kubectl'

# Helmfile is a declarative spec for deploying helm charts.
brew 'helmfile'

# Lens is an IDE and Dashboard for Kubernetes
cask 'lens'

##
# Utilities
#
# We prefer Firefox because it's open source.
##

brew 'ack'

# bat is like `cat` plus line numbers, syntax highlighting, and more.
brew 'bat'

# Intuitive find & replace CLI (sed alternative)
brew 'sd'

brew 'brotli'
brew 'broot'
brew 'coreutils'
brew 'dep'
brew 'diff-so-fancy'
brew 'exa'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'gcc'
brew 'geckodriver'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnupg2'
brew 'gnuplot'
brew 'go'
brew 'htop'
brew 'hugo'
brew 'irssi'
brew 'libyaml'
brew 'lynis'
brew 'mas'
brew 'moreutils'
brew 'ncdu'
brew 'neovim'
brew 'nmap'
brew 'openssh'
brew 'openssl'
brew 'pandoc'
brew 'pinentry-mac'
brew 'pyenv'
brew 'rbenv'
brew 'ripgrep'
brew 'screen'
brew 'sccache'
brew 'shellcheck'
brew 'sqlite'
brew 'starship'
brew 'ssh-copy-id'
brew 'task'
brew 'tmux'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew "upx"
brew "tor"
brew "yarn"
brew "zola"
brew "zstd"
brew "zlib"
brew "getantibody/tap/antibody"


#Casks
cask 'alfred'
cask 'docker'
cask 'flux'
cask 'chromedriver'
cask 'firefox'
cask 'iterm2'
cask 'insomnia'
cask 'kap'
cask 'karabiner-elements'
cask 'lulu'
cask 'rectangle'
cask 'spotify'
cask 'wireshark'
cask 'telegram'

#Mac Applications
mas "Amphetamine" id: 937984704
mas "Bear", id: 1091189122
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Monit", id: 1014850245
mas "Numbers", id: 409203825
mas "Owly", id: 882812218
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
