cask_args appdir: '/Applications'

#Common Taps for the services I install
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'

# Install ZSH for my shell
brew 'zsh'
brew 'zsh-completions'

brew 'archey'
brew 'awscli'
brew 'gcc'
brew 'p7zip'
brew 'coreutils'
brew 'git'
brew 'docker'
brew 'docker-clean'
brew 'libyaml'
brew 'docker-compose'
brew 'findutils'
brew 'flow'
brew 'git-flow'
brew 'git-lfs'
brew 'go'
brew 'glide'
brew 'gnu-sed', args: ['with-default-names']
brew 'gpg-agent'
brew 'gnupg2'
brew 'mas'
brew 'openssl'
brew 'sqlite'
brew 'python3'
brew 'mysql'
brew 'lynis'
brew 'moreutils'
brew 'node'
brew 'nvm'
brew 'pinentry-mac'
brew 'python'
brew 'postgresql'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'vim', args: ['with-override-system-vi']
brew 'wget', args: ['with-iri']
brew 'yarn'
brew 'tmux'
brew 'neovim'
brew 'grep'
brew 'openssh'
brew 'screen'
brew 'cockroach'
brew 'dep'
brew 'fzf'
brew 'geckodriver'
brew 'chromedriver'
brew 'brotli'

#Casks
cask 'atom'
cask 'google-chrome'
cask 'slack'
cask 'vlc'
cask 'alfred'
cask 'spotify'
cask 'evernote'
cask 'flux'
cask 'google-drive'
cask 'iterm2'
cask 'ubersicht'
cask 'sqlitebrowser'
cask 'telegram'
cask 'xquartz'
