tap 'bramstein/webfonttools'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'codekitchen/dinghy'
tap 'dart-lang/dart'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'
brew 'ack'
brew 'archey'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'readline'
brew 'bash'
brew 'bash-completion'
brew 'binutils'
brew 'gmp'
brew 'isl'
brew 'mpfr'
brew 'libmpc'
brew 'gcc'
brew 'p7zip'
brew 'ssdeep'
brew 'xz'
brew 'binwalk'
brew 'cifer'
brew 'coreutils'
brew 'gettext'
brew 'cracklib'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'git'
brew 'docker'
brew 'docker-clean'
brew 'docker-machine'
brew 'libyaml'
brew 'docker-compose'
brew 'dos2unix'
brew 'fcrackzip'
brew 'findutils'
brew 'flow'
brew 'foremost'
brew 'fortune'
brew 'libpng'
brew 'freetype'
brew 'fswatch'
brew 'gawk'
brew 'gdbm'
brew 'giflib'
brew 'gifsicle'
brew 'git-flow'
brew 'git-lfs'
brew 'go'
brew 'glide'
brew 'gnu-sed', args: ['with-default-names']
brew 'pinentry'
brew 'gpg-agent'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg2'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'grc'
brew 'openssl'
brew 'sqlite'
brew 'python3'
brew 'hashpump'
brew 'mysql'
brew 'hydra'
brew 'jpeg'
brew 'libtiff'
brew 'libtool'
brew 'imagemagick'
brew 'imagesnap'
brew 'imlib2'
brew 'jasper'
brew 'john'
brew 'jp2a'
brew 'oniguruma'
brew 'jq'
brew 'knock'
brew 'libcaca', args: ['with-imlib2']
brew 'libdnet'
brew 'libssh2'
brew 'libgit2'
brew 'libidn'
brew 'lua'
brew 'lynis'
brew 'lynx'
brew 'moreutils'
brew 'netpbm'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'openconnect'
brew 'pcre'
brew 'pigz'
brew 'pinentry-mac'
brew 'pkg-config'
brew 'pngcheck'
brew 'python'
brew 'postgresql'
brew 'pv'
brew 'qt'
brew 'rancher-compose'
brew 'rename'
brew 'rhino'
brew 'roundup'
brew 'shellcheck'
brew 'socat'
brew 'spaceman-diff'
brew 'spark'
brew 'speedtest_cli'
brew 'sqlmap'
brew 'ssh-copy-id'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'testssl'
brew 'tree'
brew 'ttyrec'
brew 'ucspi-tcp'
brew 'unrar'
brew 'vim', args: ['with-override-system-vi']
brew 'watch'
brew 'watchman'
brew 'webkit2png'
brew 'wget', args: ['with-iri']
brew 'yarn'
brew 'zopfli'
brew 'bramstein/webfonttools/sfnt2woff'
brew 'bramstein/webfonttools/sfnt2woff-zopfli'
brew 'bramstein/webfonttools/woff2'
brew 'dart-lang/dart/dart'
brew 'homebrew/boneyard/shiboken'
brew 'homebrew/boneyard/pyside'
brew 'homebrew/boneyard/unfs3'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'homebrew/versions/bash-completion2'
