cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'archey'
brew 'awscli'
brew 'bash'
brew 'gcc'
brew 'p7zip'
brew 'coreutils'
brew 'git'
brew 'docker'
brew 'docker-clean'
brew 'docker-machine'
brew 'libyaml'
brew 'docker-compose'
brew 'findutils'
brew 'flow'
brew 'git-flow'
brew 'git-lfs'
brew 'go'
brew 'glide'
brew 'gnu-sed', args: ['with-default-names']
brew 'gpg-agent'
brew 'gnupg2'
brew 'openssl'
brew 'sqlite'
brew 'python3'
brew 'mysql'
brew 'lynis'
brew 'moreutils'
brew 'node'
brew 'nvm'
brew 'pinentry-mac'
brew 'python'
brew 'postgresql'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'vim', args: ['with-override-system-vi']
brew 'wget', args: ['with-iri']
brew 'yarn'


brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'homebrew/versions/bash-completion2'

cask 'hyperterm'
cask 'atom'
cask 'google-chrome'
cask 'slack'
cask 'vlc'
