# frozen_string_literal: true

cask_args appdir: "/Applications"

# =============================================================================================
# Taps
# =============================================================================================

tap "homebrew/bundle"
tap "homebrew/services"

# =============================================================================================
# Programming languages
# =============================================================================================

# Development Langs, Compilers, Package Managers and SDKs
brew "gcc"

# Version Manager for all of our local and global languages (Any not listed here)
brew "mise"

# Container runtime (Replaces Docker Desktop)
brew "colima"

# Docker Runtime (Used with Colima above)
brew "docker"
brew "docker-compose"

# =============================================================================================
# CLI Tools
# =============================================================================================

# utility to run Github actions locally for testing.
brew "act"

# Logfile Highlighter mappedf to "tail"
brew "tailspin"

# Atuin replaces your existing shell history with a SQLite database, and records additional context for your commands.
brew "atuin"

# bat is like `cat` plus line numbers, syntax highlighting, and more.
brew "bat"

# Intuitive find & replace CLI (sed alternative)
brew "sd"

# Replacement for Exa -- aka replacement for ls
brew "eza"

# Better Git Diffs
brew "diff-so-fancy"

# Alternative to find
brew "fd"

# Fuzzy Finder
brew "fzf"

# Better "top" utility
brew "bottom"

# Disk space analyzer
brew "ncdu"

# Port scanning utility
brew "nmap"

# Http tool
brew "wget"

# Improved version of grep
brew "ripgrep"

# JSON Parser
brew "jq"

# command-line unarchiving tools supporting multiple formats
brew "unar"

# =============================================================================================
# CLI Applications
# =============================================================================================

# Security utility
brew "lynis"

# Terminal based editor
brew "neovim"

# Git - Keeps it up to date
brew "git"

# ZSH Plugin manager
brew "antidote"

# Cluster management tool for AWS.
brew "kops"

# GPG
brew "gnupg"

# Terminal Multiplexer
brew "tmux"

# Terminal based file manager
brew "yazi"

# =============================================================================================
# Development Packages
# =============================================================================================

# Protocol Buffers - used for protobuf development e.g. GRPC
brew "protobuf"

# Lossless compression algorithm
brew "brotli"

# Like Chromedriver but for Firefox
brew "geckodriver"

# GUI for PGP
brew "pinentry-mac"

# Cache for Rust
brew "sccache"

# Terminal Prompt
brew "starship"

# Mac Apple Store CLI
brew "mas"

# Homebrew managed OpenSSH
brew "openssh"

# Homebrew managed Open SSL
brew "openssl"

# Library for Yubi keys
brew "libfido2"

# ZSH Shell
brew "zsh"

# ZSH Completions
brew "zsh-completions"

# Real time compression algorithm
brew "zstd"

# Lossless Compression Algorithm
brew "zlib"

# Tor network
brew "tor"

# =============================================================================================
# Non-Mac Store Applications
# =============================================================================================

cask "discord"

# Lens is an IDE and Dashboard for Kubernetes
cask "lens"

# Pear Cleaner - Mac application cleaner
cask "pearcleaner"

# Password Manager - Not available via Mac Store
cask "1password"

# CLI for 1Password
cask "1password-cli"

# Tints screen orange to protect my eyeballs at night
cask "flux"

# Terminal used to replace Mac's base Terminal
cask "iterm2"

# API Manager and Tester
cask "insomnia"

# Screen recorder for mac
cask "kap"

# Custom Keymapper - used currently to map caps lock to a hyper key.
cask "karabiner-elements"

# Firewall Extension for mac
cask "lulu"

# Window Manager via keybindings
cask "rectangle"

# Spotifty
cask "spotify"

# An alternative to OSX's native spotlight search. Comes with lots of nice features out of the gate to enhance productivity.
cask "raycast"

# Note management application
cask "obsidian"

# Shows mac stats in the menubar
cask "stats"

# Firefox web browser
cask "firefox"

# Firefox developer edition, which features programming tools.
cask "firefox@developer-edition"

# Brave web browser, which features security by default.
cask "brave-browser"

# Ungoogled Chromium
cask "eloston-chromium"

# =============================================================================================
# Fonts
# =============================================================================================

# Font used for coding ligatures
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"

# =============================================================================================
# Applications
# =============================================================================================

# 1Password Safari Extensions
mas "1Password for Safari", id: 1_569_813_296

# Photo editing software
mas "Affinity Photo", id: 824_183_456

# Prevents Mac from Sleeping
mas "Amphetamine", id: 937_984_704

# Music
mas "GarageBand", id: 682_658_836

# Movies
mas "iMovie", id: 408_981_434

# Slideshows
mas "Keynote", id: 409_183_694

# Money Management
mas "MoneyWiz", id: 1_511_185_140

# Excel
mas "Numbers", id: 409_203_825

# Docs
mas "Pages", id: 409_201_541

# Messaging Application
mas "Telegram", id: 747_648_890

# Mac Development
mas "Xcode", id: 497_799_835
